export const regionList = [
  '서울특별시',
  '부산광역시',
  '대구광역시',
  '인천광역시',
  '광주광역시',
  '대전광역시',
  '울산광역시',
  '세종특별자치시',
  '경기도',
  '강원특별자치도',
  '충청북도',
  '충청남도',
  '전라북도',
  '전라남도',
  '경상북도',
  '경상남도',
  '제주특별자치도',
]

export const districtList = [
  // 서울특별시
  [
    '강남구',
    '강동구',
    '강북구',
    '강서구',
    '관악구',
    '광진구',
    '구로구',
    '금천구',
    '노원구',
    '도봉구',
    '동대문구',
    '동작구',
    '마포구',
    '서대문구',
    '서초구',
    '성동구',
    '성북구',
    '송파구',
    '양천구',
    '영등포구',
    '용산구',
    '은평구',
    '종로구',
    '중구',
    '중랑구',
  ],

  // 부산광역시
  [
    '강서구',
    '금정구',
    '기장군',
    '남구',
    '동구',
    '동래구',
    '부산진구',
    '북구',
    '사상구',
    '사하구',
    '서구',
    '수영구',
    '연제구',
    '영도구',
    '중구',
    '해운대구',
  ],

  // 대구광역시
  ['남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구'],

  // 인천광역시
  ['강화군', '계양구', '남동구', '동구', '미추홀구', '부평구', '서구', '연수구', '옹진군', '중구'],

  // 광주광역시
  ['광산구', '남구', '동구', '북구', '서구'],

  // 대전광역시
  ['대덕구', '동구', '서구', '유성구', '중구'],

  // 울산광역시
  ['남구', '동구', '북구', '중구', '울주군'],

  // 세종특별자치시
  ['조치원읍', '한솔동', '도담동', '아름동', '종촌동', '고운동', '보람동', '새롬동', '나성동'],

  // 경기도
  [
    '수원시',
    '성남시',
    '고양시',
    '용인시',
    '부천시',
    '안산시',
    '안양시',
    '남양주시',
    '화성시',
    '평택시',
  ],

  // 강원특별자치도
  [
    '춘천시',
    '원주시',
    '강릉시',
    '동해시',
    '속초시',
    '삼척시',
    '홍천군',
    '횡성군',
    '평창군',
    '정선군',
  ],

  // 충청북도
  [
    '청주시',
    '충주시',
    '제천시',
    '보은군',
    '옥천군',
    '영동군',
    '증평군',
    '진천군',
    '괴산군',
    '단양군',
  ],

  // 충청남도
  [
    '천안시',
    '공주시',
    '보령시',
    '아산시',
    '서산시',
    '논산시',
    '계룡시',
    '당진시',
    '금산군',
    '부여군',
  ],

  // 전라북도
  [
    '전주시',
    '군산시',
    '익산시',
    '정읍시',
    '남원시',
    '김제시',
    '완주군',
    '진안군',
    '무주군',
    '장수군',
  ],

  // 전라남도
  [
    '목포시',
    '여수시',
    '순천시',
    '나주시',
    '광양시',
    '담양군',
    '곡성군',
    '구례군',
    '고흥군',
    '보성군',
  ],

  // 경상북도
  [
    '포항시',
    '경주시',
    '김천시',
    '안동시',
    '구미시',
    '영주시',
    '영천시',
    '상주시',
    '문경시',
    '경산시',
  ],

  // 경상남도
  [
    '창원시',
    '진주시',
    '통영시',
    '사천시',
    '김해시',
    '밀양시',
    '거제시',
    '양산시',
    '의령군',
    '함안군',
  ],

  // 제주특별자치도
  ['제주시', '서귀포시'],
]
